/*
온디맨드 S/W 스트리밍(On-demand software streaming) 기술은 스트리밍 기법을 통하여 서버에 존재하는 응용 프로그램 
이미지 중 일부를 클라이언트에서 실행하는 기술로서, 클라이언트는 응용 프로그램을 자신의 저장 장치에 전체 다운로드 
및 직접 설치하지 않고도 실행에 필요한 부분만 네트워크를 통하여 서버로부터 전송받아 실행시킬 수 있다. (그림 1)은 
온디맨드 S/W 스트리밍 기술의 개념을 보여주고 있다. 이와 관련된 유사한 스트리밍 기술로는 RealNetworks, QuickTime, 
Microsoft의 Windows Media Player 등에서 동영상 데이터를 스트리밍으로 서비스하는데 오래전부터 널리 적용되어 왔던 
기술이 있으나, 이들은 연속 미디어 처리를 위한 스트리밍 기술이며, 본 고에서 논하는 S/W를 대상으로 하는 스트리밍과는 
차이가 있다.
온디맨드 S/W 스트리밍 기술은, 클라이언트에서 S/W들을 자신의 저장 장치에 설치함으로써 야기되는 S/W 관리에 관련된 여러 가지 문제들을 간단히 해결해주며, S/W의 설치, 유통, 유지보수와 관련된 전반적인 영역에서 새로운 패러다임을 창출하는 기반이 된다.

온디맨드 S/W 스트리밍 기술의 핵심은 클라이언트에서 수행에 필요한 S/W 모듈의 현재 소재를 파악하고, 필요한 경우 해당 
S/W 모듈을 서버로부터 전송 받아 S/W가 실행될 수 있도록 하는데 있다. 현재 S/W 스트리밍 관련 핵심 기술은 국내 업체인 
소프트온넷과 국외 업체인 AppStream, Softricity, Stream Threory, Exent Technologies 등에서 보유하고 있는데, 대부분이
기업체, 회사, 학교의 전산실 등과 같은 한정된 사용자를 대상으로 하는 폐쇄된 네트워크 환경에서 MS 윈도 사용자만을 
위한 서비스가 구현되어 사용되고 있다
*/
