/*
TRACEROUTE
linux에서 traceroute www.goolge.com 과 같이 사용할 수 있음
와이어샤크를 통해 분석해보면 udp를 사용하는것을 알 수 있음 
traceroute 혹은 tracert는 인터넷을 통해 거친 경로를 표시하고 그 구간의 정보를 기록하고 인터넷 프로토콜 네트워크를 
통해 패킷의 전송 지연을 측정하기 위한 컴퓨터 네트워크 진단 유틸리티이다.[1]
IPv6(인터넷 프로토콜 버전 6)의 경우 도구는 traceroute6[2] 및 tracert6라는 이름으로 되어 있는 경우가 있다.[3]


SNMP
간이 망 관리 프로토콜(Simple Network Management Protocol, SNMP)은 IP 네트워크상의 장치로부터 정보를 수집 및 
관리하며, 또한 정보를 수정하여 장치의 동작을 변경하는 데에 사용되는 인터넷 표준 프로토콜이다. SNMP를 지원하는 
대표적인 장치에는 라우터, 스위치, 서버, 워크스테이션, 프린터, 모뎀 랙 등이 포함된다.[1]
SNMP는 네트워크 모니터링의 목적으로 네트워크 관리에서 널리 사용된다. SNMP는 관리 정보 베이스(Management Information 
Base) 상에 관리 중인 시스템의 상태와 설정을 변수의 형태로 관리할 수 있게 해준다. 이러한 변수들은 관리 프로그램에 
의해 원격에서 질의될 수 있으며, 경우에 따라서는 원격에서 값을 설정할 수도 있다.
현재 사용되는 SNMP의 주요 버전은 세 가지로, SNMPv1이 가장 초기 버전이며 이후 개발된 SNMPv2와 SNMPv3는 성능 및 
유연성, 보안성 면에서 향상된 버전이다.
SNMP는 국제 인터넷 표준화 기구에 의해 정의된 인터넷 프로토콜 스위트의 일부분이다. 인터넷 프로토콜 스위트는 응용 
계층 프로토콜, 데이터베이스 명세, 데이터 객체 집합 등을 포함하는 네트워크 관리용 표준들로 구성되어 있다.[2] 

*/


